#!/usr/bin/env python
# coding:utf-8 
# +------------------------------------------
# | author: guijianliang
# | date： 2018/11/18 13:22
# +------------------------------------------
import sys
sys.path.append('/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages')
from flask import render_template, redirect, url_for, request, g, current_app
from flask import jsonify
from . import api
from collections import OrderedDict
import tushare as ts
import numpy as np
import copy

@api.route('/test')
def test():
    return 'test页面'


@api.route('/test_common')
def test2():
    return render_template('test_commam.html')


@api.route('/gupiao')
def check_gupiao():
    return render_template('gupiao.html')


@api.route('/zxg')
def zxg():
    return jsonify(
        {
            '澳洋顺昌': [
                {
                    'ma5': [4.772, 4.774, 4.808, 4.796, 4.66, 4.564, 4.522, 4.442, 4.362, 4.376]
                },
                {
                    'ma10': [4.534, 4.559, 4.618, 4.66, 4.67, 4.668, 4.648, 4.625, 4.579, 4.518]
                },
                {
                    'ma20': [4.252, 4.284, 4.327, 4.366, 4.386, 4.413, 4.439, 4.464, 4.479, 4.495]
                },
                {
                    'date': ['2018-11-19', '2018-11-20', '2018-11-21', '2018-11-22', '2018-11-23', '2018-11-26',
                             '2018-11-27', '2018-11-28', '2018-11-29', '2018-11-30']
                }],
            '北化股份': [
                {
                    'ma5': [7.53, 7.602, 7.65, 7.678, 7.576, 7.434, 7.354, 7.314, 7.222, 7.234]
                },
                {
                    'ma10': [7.323, 7.363, 7.413, 7.476, 7.486, 7.482, 7.478, 7.482, 7.45, 7.405]
                },
                {
                    'ma20': [7.08, 7.127, 7.16, 7.206, 7.224, 7.25, 7.274, 7.302, 7.318, 7.326]
                },
                {
                    'date': ['2018-11-19', '2018-11-20', '2018-11-21', '2018-11-22', '2018-11-23', '2018-11-26',
                             '2018-11-27', '2018-11-28', '2018-11-29', '2018-11-30']
                }],
            '大洋电机': [
                {
                    'ma5': [3.82, 3.832, 3.834, 3.824, 3.748, 3.696, 3.678, 3.66, 3.614, 3.64]
                },
                {
                    'ma10': [3.662, 3.688, 3.718, 3.747, 3.755, 3.758, 3.755, 3.747, 3.719, 3.694]
                },
                {
                    'ma20': [3.554, 3.575, 3.595, 3.618, 3.615, 3.625, 3.637, 3.649, 3.654, 3.661]
                },
                {
                    'date': ['2018-11-19', '2018-11-20', '2018-11-21', '2018-11-22', '2018-11-23', '2018-11-26',
                             '2018-11-27', '2018-11-28', '2018-11-29', '2018-11-30']
                }]
        })


@api.route('/zxg1')
def zxg1():
    return 'heh'